examples/LAMMPS_OPENFOAM/openfoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 16.795961913825074;

interp_BC true;

vertices
(
    (0 0 0)
    (1.0 0 0)
    (1.0 2.7 0)
    (0 2.7 0)
    (0 0 1.0)
    (1.0 0 1.0)
    (1.0 2.7 1.0)
    (0 2.7 1.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (8 8 8) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
      (
           (3 7 6 2)
      );
    }
    CPLReceiveMD
    {
        type patch;
        faces
       (
          (1 5 4 0)
      );        
    }
    streamwiseIn
    {
        type cyclic;
        neighbourPatch streamwiseOut;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
