examples/LAMMPS_OPENFOAM/openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    movingWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          64;
        startFace       1344;
    }
    CPLReceiveMD
    {
        type            patch;
        nFaces          64;
        startFace       1408;
    }
    streamwiseIn
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          64;
        startFace       1472;
        matchTolerance  0.0001;
        neighbourPatch  streamwiseOut;
        transformType   translational;
        separation      (-16.79596191382507 0 0);
    }
    streamwiseOut
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          64;
        startFace       1536;
        matchTolerance  0.0001;
        neighbourPatch  streamwiseIn;
        transformType   translational;
        separation      (16.79596191382507 0 0);
    }
    front
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          64;
        startFace       1600;
        matchTolerance  0.0001;
        neighbourPatch  back;
        transformType   translational;
        separation      (0 0 16.79596191382507);
    }
    back
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          64;
        startFace       1664;
        matchTolerance  0.0001;
        neighbourPatch  front;
        transformType   translational;
        separation      (0 0 -16.79596191382507);
    }
)

// ************************************************************************* //
